"""
Ваша програма повинна вміти розділяти один список на два та помістити їх у новий список. Тобто, в результаті повинен вийти список із 2-х списків.

Якщо в початковому списку непарна кількість елементів, то в першому списку має бути більше елементів.

Якщо у списку немає елементів, то має бути створений список із двома порожніми списками.

Важливо! Потрібно створити рішення, яке обробляє 3 випадки - список порожній, у списку парна кількість елементів і в списку непарна кількість елементів.

Приклади:

Було => стало

[1, 2, 3, 4, 5, 6] => [[1, 2, 3], [4, 5, 6]]
[1, 2, 3] => [[1, 2], [3]]
[1, 2, 3, 4, 5] => [[1, 2, 3], [4, 5]]
[1] => [[1], []]
[] => [[], []]
Для перевірки коректності роботи Вашого коду використовуйте приклади вище. Робити запит на введення даних від користувача не потрібно.
"""

arr = [[1, 2, 3, 4, 5, 6], [1, 2, 3], [1, 2, 3, 4, 5], [1], [], ['n', 1, 2, -8, 9]]

print("Незмінені списки")
# Я використовую цикл for для додаткової практики
for i in range(len(arr)):
    print(arr[i])

print("\nЗмінені списки")
for i in range(len(arr)):
    arr_length = len(arr[i])

    # Можна прибрати "and arr_length != 0" і програма все одно буде правильно працювати
    if arr_length % 2 == 0 and arr_length != 0:
        changed_arr = [arr[i][:arr_length // 2], arr[i][arr_length // 2:]]
        print(changed_arr)
    # По ідеї, без цієї перевірки пустий список усе одно буде правильно оброблятись,
    # але вирішив додати цю перевірку, тому що вимагає завдання
    elif arr_length == 0:
        changed_arr = [[], []]
        print(changed_arr)
    else:
        changed_arr = [arr[i][:(arr_length // 2) + 1], arr[i][(arr_length // 2) + 1:]]
        print(changed_arr)