"""
Ваша програма має перенести останній елемент списку з кінця на початок, тобто, останній елемент списку має стати першим.
Послідовність інших елементів не має змінюватися.

Порожній список або список з одним елементом повинен залишитися незмінним.

Кількість елементів у списку може бути будь-яким – нуль та більше!

Copy code
Приклади:
[12, 3, 4, 10] => [10, 12, 3, 4]
[1] => [1]
[] => []
[12, 3, 4, 10, 8] => [8, 12, 3, 4, 10]
Для перевірки коректності роботи Вашого коду використовуйте приклади вище. Робити запит на введення даних від користувача не потрібно.
"""

arr = [[12, 3, 4, 10], [1], [], [12, 3, 4, 10, 8], [-1, 23, 99, -108, 'n']]

print("Незмінені списки")
for i in range(len(arr)):
    print(arr[i])

print("\nЗмінені списки (окрім порожнього та з одним елементом)")
for i in range(len(arr)):
    if len(arr[i]) == 0:
        print([])
    else:
        new_arr = arr[i][-1:] + arr[i][:-1]
        print(new_arr)